Enums/ВидыОперацийПоступлениеТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеТоваровУслуг</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПокупкаКомиссия</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПереработку</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъектыСтроительства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БланкиСтрогогоУчета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПоступленияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыПоступленияТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСклад</Name>
					<Comment>(Общ) Поступление на склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОрдеру</Name>
					<Comment>(Упр) Поступление по приходному ордеру</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>(Общ) Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>(Общ) Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бартерный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВедениеВзаиморасчетовПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВедениеВзаиморасчетовПоДоговорам</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДоговоруВЦелом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПоРасчетнымДокументам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСчетам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыЗатрат</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Материальные</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочие</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаТруда</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчисленияНаСоциальныеНужды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Амортизация</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ХарактерЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ХарактерЗатрат</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БракВПроизводстве</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВложенияВоВнеоборотныеАктивы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыНаСбыт</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщепроизводственныеРасходы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдминистративныеРасходы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводственныеРасходы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочие</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеОперационныеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранспортноЗаготовительныеРасходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплект</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СегментыРекламы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СегментыРекламы</Name>
			<Comment>Розница / опт / дропшип для расхода на рекламу</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Розница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дропшип</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/РекламныеКампании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>РекламныеКампании</Name>
			<Comment>Кампании рекламных кабинетов; заполняется загрузкой расхода</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКампании</Name>
					<Comment>ID кампании в кабинете — ключ склейки с utm_campaign заказа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Канал</Name>
					<Comment>google ads / facebook ads — как в normalizeSource сайта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сегмент</Name>
					<Comment>Назначается вручную; пустой = не задан</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СегментыРекламы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючИсточника</Name>
					<Comment>Как в реквизите referrer заказа: "utm_source utm_campaign"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Услуга, которой кампания попадает в поступление товаров и услуг</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен документа начисления - им расход ложится в ту же ветку отчёта, что и продажи сегмента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючИсточникаСтарый</Name>
					<Comment>Ключ до перестановки меток в кабинете - им отчёт переписывает старые заказы на текущий ключ кампании</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоДожим</Name>
					<Comment>Кампания только дожимает того, кто уже был на сайте (ремаркетинг, брошенная корзина) - выручку за привод не берёт, уходит в «Дожал»</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ЗагрузкаРекламногоРасхода/Ext/Module.bsl
// Загрузка расхода рекламных кабинетов с сайта в документы «Поступление
// товаров и услуг». Источник - shop/ad_spend_export.php на cvetkovtm.com:
// он отдаёт то, что уже собрали крон Meta и скрипт кабинета Google Ads.
//
// Почему документами, а не регистром: расход - это покупка услуги у поставщика.
// Документ даёт контрагента, номенклатуру и кредиторку, которую закрывает
// исходящий платёж из обмена Приват24. Заодно строки расхода ложатся на те же
// группировки отчёта «Ведомость реализации», что и продажи.
//
// Документ = день х канал х тип цен. Тип цен берётся у кампании и нужен затем,
// чтобы расход попал в ту же ветку отчёта, что и продажи своего сегмента;
// в одном канале за день бывают и оптовые, и розничные кампании, а тип цен
// в документе один - отсюда и деление.
//
// Идемпотентность: документ находится по маркеру в комментарии
// (см. МаркерДокумента), строки услуг перезаписываются целиком. Повторный
// прогон того же окна дублей не создаёт.
//
// Ключ склейки с выручкой живёт в реквизите КлючИсточника самой кампании,
// оттуда его берёт отчёт соединением по номенклатуре. Сайт умеет посчитать ключ
// только из идентификатора кампании, а в ссылках кабинета может стоять что угодно
// («facebook cold_catalog_atc»), поэтому поле ручное: загрузчик заполняет его,
// только пока оно пустое, и никогда не затирает вписанное человеком.
//
// Адрес и токен зашиты в АдресВыгрузки и ТокенВыгрузки; одноимённые константы,
// если их заполнить, значение переопределяют. Расписание регламентного задания
// в метаданных не хранится, его задают в самой базе.

// Адрес выгрузки на сайте: константа, иначе зашитое значение.
Функция АдресВыгрузки() Экспорт

	Значение = СокрЛП(Строка(Константы.АдресРекламногоРасхода.Получить()));

	Если ПустаяСтрока(Значение) Тогда
		Значение = "https://cvetkovtm.com/assets/shop/ad_spend_export.php";
	КонецЕсли;

	Возврат Значение;

КонецФункции

// Токен выгрузки: константа, иначе зашитое значение.
// Совпадает с AD_SPEND_EXPORT_TOKEN в shop/ad_spend_export.php - меняются парой.
Функция ТокенВыгрузки() Экспорт

	Значение = СокрЛП(Строка(Константы.ТокенРекламногоРасхода.Получить()));

	Если ПустаяСтрока(Значение) Тогда
		Значение = "4f1c9d0a7b3e42a58c6d10e9fb27a453";
	КонецЕсли;

	Возврат Значение;

КонецФункции

// Точка входа регламентного задания: скользящее окно последних дней.
// Кабинеты уточняют расход задним числом, поэтому перезагружаем неделю,
// а не только вчера.
Процедура ЗаданиеЗагрузка() Экспорт

	Рез = ЗагрузитьЗаПериод(НачалоДня(ТекущаяДатаСеанса() - 7 * 86400), НачалоДня(ТекущаяДатаСеанса()));

	Если Рез.Успешно Тогда
		Уровень = УровеньЖурналаРегистрации.Информация;
	Иначе
		Уровень = УровеньЖурналаРегистрации.Ошибка;
	КонецЕсли;

	ЗаписьЖурналаРегистрации("ЗагрузкаРекламногоРасхода", Уровень, , , Рез.Сообщение);

КонецПроцедуры

// Загрузить расход за период и разложить по документам поступления.
// Возврат: структура Успешно / Сообщение / Документов / Сумма.
Функция ЗагрузитьЗаПериод(ДатаНач, ДатаКон) Экспорт

	Рез = Новый Структура("Успешно, Сообщение, Документов, Сумма", Ложь, "", 0, 0);

	// Регламентное задание крутится под своим пользователем, и прав на контрагентов,
	// статьи затрат и номенклатуру у него может не быть - «Нарушение прав доступа»
	// прямо на НайтиПоНаименованию. Привилегированный режим ставим методом, а не
	// флагом модуля: флаг делает модуль серверным, и обработка «Запуск регламентных
	// заданий», которая выполняет задание на клиенте, перестаёт его видеть.
#Если Сервер Тогда
	УстановитьПривилегированныйРежим(Истина);
#КонецЕсли

	Начало = НачалоДня(?(ЗначениеЗаполнено(ДатаНач), ДатаНач, ТекущаяДатаСеанса() - 30 * 86400));
	Конец  = НачалоДня(?(ЗначениеЗаполнено(ДатаКон), ДатаКон, ТекущаяДатаСеанса()));

	Если Начало > Конец Тогда
		Врем   = Начало;
		Начало = Конец;
		Конец  = Врем;
	КонецЕсли;

	Ответ = ПолучитьВыгрузку(Начало, Конец);
	Если Не Ответ.Успешно Тогда
		Рез.Сообщение = Ответ.Сообщение;
		Возврат Рез;
	КонецЕсли;

	Данные = Ответ.Данные;

	Если Данные.Получить("ok") <> Истина Тогда
		Рез.Сообщение = "Сайт ответил ошибкой: " + Строка(Данные.Получить("error"));
		Возврат Рез;
	КонецЕсли;

	Организация = ОрганизацияНачисления();
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Рез.Сообщение =
			"Не определена организация: нет организации с кодом 000000001,"
			+ " заполните константу ОрганизацияРекламы.";
		Возврат Рез;
	КонецЕсли;

	// Окно берём из ответа: сайт мог обрезать его своим потолком, и трогать дни,
	// которых он не присылал, нельзя
	ОкноНачало = ДатаИзСтроки(Данные.Получить("from"), Начало);
	ОкноКонец  = ДатаИзСтроки(Данные.Получить("to"), Конец);

	Строки = Данные.Получить("rows");
	Если ТипЗнч(Строки) <> Тип("Массив") Тогда
		Рез.Сообщение = "В ответе нет массива rows.";
		Возврат Рез;
	КонецЕсли;

	КэшКампаний = Новый Соответствие;
	Группы = Новый Соответствие;
	ВсегоСумма = 0;

	Для Каждого Стр Из Строки Цикл

		Если ТипЗнч(Стр) <> Тип("Соответствие") Тогда
			Продолжить;
		КонецЕсли;

		День = ДатаИзСтроки(Стр.Получить("date"), Дата(1, 1, 1));
		Если Не ЗначениеЗаполнено(День) Тогда
			Продолжить;
		КонецЕсли;

		Сумма = ЧислоИзЗначения(Стр.Получить("spend_uah"));
		Если Сумма <= 0 Тогда
			Продолжить;
		КонецЕсли;

		Канал = Лев(СокрЛП(Строка(Стр.Получить("channel"))), 32);

		// Ключ режем по длине реквизита referrer заказа - Строка(200). Платформа
		// усекает молча, обрезать надо одинаково с обеих сторон, иначе длинные
		// ключи никогда не совпадут
		Ключ = Лев(СокрЛП(Строка(Стр.Получить("key"))), 200);

		Кампания = КампанияПоСтроке(Стр, Ключ, КэшКампаний);

		ТипЦен = Неопределено;
		Если ЗначениеЗаполнено(Кампания) Тогда
			ТипЦен = Кампания.ТипЦен;
		КонецЕсли;
		Если ТипЦен = Неопределено Тогда
			ТипЦен = Справочники.ТипыЦенНоменклатуры.ПустаяСсылка();
		КонецЕсли;

		КлючГруппы = Формат(День, "ДФ=yyyyMMdd") + "|" + Канал + "|" + Строка(ТипЦен.УникальныйИдентификатор());

		Группа = Группы.Получить(КлючГруппы);
		Если Группа = Неопределено Тогда
			Группа = Новый Структура("День, Канал, ТипЦен, Строки", День, Канал, ТипЦен, Новый Массив);
			Группы.Вставить(КлючГруппы, Группа);
		КонецЕсли;

		Группа.Строки.Добавить(Новый Структура("Кампания, Ключ, Сумма", Кампания, Ключ, Сумма));
		ВсегоСумма = ВсегоСумма + Сумма;

	КонецЦикла;

	Итог = ЗаписатьДокументы(Организация, ОкноНачало, ОкноКонец, Группы);
	Дублей = УдалитьДублиКампаний();
	КлючейПоровну = ПроверитьКлючиКампаний();

	Рез.Успешно   = Истина;
	Рез.Документов = Итог.Документов;
	Рез.Сумма     = ВсегоСумма;
	Рез.Сообщение =
		"Рекламный расход "
		+ Формат(ОкноНачало, "ДФ=dd.MM.yyyy") + "-" + Формат(ОкноКонец, "ДФ=dd.MM.yyyy")
		+ ": документов " + Строка(Итог.Документов)
		+ ", сумма " + Формат(ВсегоСумма, "ЧДЦ=2; ЧРГ=' '") + " грн."
		+ ?(Итог.НеПроведено = 0, "", " НЕ ПРОВЕДЕНО: " + Строка(Итог.НеПроведено))
		+ ?(Итог.Лишних = 0, "", " документов удалено: " + Строка(Итог.Лишних))
		+ ?(Дублей = 0, "", " дублей кампаний удалено: " + Строка(Дублей))
		+ ?(ПустаяСтрока(КлючейПоровну), "", " ВНИМАНИЕ: " + КлючейПоровну);

	Возврат Рез;

КонецФункции

// Запросить выгрузку у сайта и разобрать JSON.
Функция ПолучитьВыгрузку(Начало, Конец)

	Рез = Новый Структура("Успешно, Сообщение, Данные", Ложь, "", Неопределено);

	Адрес = АдресВыгрузки();
	Токен = ТокенВыгрузки();

	Хост = Адрес;
	Хост = СтрЗаменить(Хост, "https://", "");
	Хост = СтрЗаменить(Хост, "http://", "");

	Поз = Найти(Хост, "/");
	Если Поз = 0 Тогда
		Рез.Сообщение = "В адресе выгрузки нет пути к файлу: " + Адрес;
		Возврат Рез;
	КонецЕсли;

	Путь = Сред(Хост, Поз);
	Хост = Лев(Хост, Поз - 1);

	Ресурс = Путь
		+ "?token=" + Токен
		+ "&from=" + Формат(Начало, "ДФ=yyyy-MM-dd")
		+ "&to=" + Формат(Конец, "ДФ=yyyy-MM-dd");

	Попытка

		Соединение = Новый HTTPСоединение(Хост, 443, , , , 60, Истина);
		Запрос = Новый HTTPЗапрос(Ресурс);
		HTTPОтвет = Соединение.Получить(Запрос);

		Если HTTPОтвет.КодСостояния <> 200 Тогда
			Рез.Сообщение = "Сайт вернул код " + Строка(HTTPОтвет.КодСостояния)
				+ " по адресу " + Хост + Путь;
			Возврат Рез;
		КонецЕсли;

		Тело = HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8");

		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(Тело);
		Рез.Данные = ПрочитатьJSON(Чтение, Истина);
		Чтение.Закрыть();

	Исключение

		Рез.Сообщение = "Не удалось получить рекламный расход: " + ОписаниеОшибки();
		Возврат Рез;

	КонецПопытки;

	Если ТипЗнч(Рез.Данные) <> Тип("Соответствие") Тогда
		Рез.Сообщение = "Сайт вернул не JSON-объект.";
		Возврат Рез;
	КонецЕсли;

	Рез.Успешно = Истина;

	Возврат Рез;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ДОКУМЕНТЫ НАЧИСЛЕНИЯ

// Маркер в комментарии документа: по нему документ находится при следующем
// прогоне. Реквизита под это в типовом документе нет, а комментарий свободен
// и виден человеку - в журнале сразу понятно, что документ автоматический.
Функция МаркерДокумента(День, Канал, ТипЦен)

	Возврат "АвтоРеклама|" + Формат(День, "ДФ=yyyy-MM-dd") + "|" + Канал
		+ "|" + СокрЛП(Строка(ТипЦен));

КонецФункции

Функция ЗаписатьДокументы(Организация, ОкноНачало, ОкноКонец, Группы)

	Итог = Новый Структура("Документов, НеПроведено, Лишних", 0, 0, 0);

	Существующие = НайтиДокументыОкна(ОкноНачало, ОкноКонец);
	Использованные = Новый Соответствие;

	Для Каждого КЗ Из Группы Цикл

		Группа = КЗ.Значение;
		Маркер = МаркерДокумента(Группа.День, Группа.Канал, Группа.ТипЦен);

		Ссылка = Существующие.Получить(Маркер);
		Использованные.Вставить(Маркер, Истина);

		Попытка
			Проведён = ЗаписатьДокументГруппы(Организация, Группа, Маркер, Ссылка);
			Итог.Документов = Итог.Документов + 1;
			Если Не Проведён Тогда
				Итог.НеПроведено = Итог.НеПроведено + 1;
			КонецЕсли;
		Исключение
			ЗаписьЖурналаРегистрации(
				"ЗагрузкаРекламногоРасхода",
				УровеньЖурналаРегистрации.Ошибка,
				,
				,
				"Не удалось записать документ " + Маркер + ": " + ОписаниеОшибки()
			);
		КонецПопытки;

	КонецЦикла;

	// Документ окна, под который в этот раз строк не нашлось: расход дня обнулился
	// или у кампании сменился тип цен и группа уехала в другой документ.
	// Удаляем непосредственно - пометками в этой базе не пользуются. Проведение
	// снимаем перед удалением, иначе останутся движения по несуществующему документу.
	Для Каждого КЗ Из Существующие Цикл
		Если Использованные.Получить(КЗ.Ключ) = Неопределено Тогда
			Попытка
				Объект = КЗ.Значение.ПолучитьОбъект();
				Если Объект.Проведен Тогда
					Объект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				КонецЕсли;
				Объект.Удалить();
				Итог.Лишних = Итог.Лишних + 1;
			Исключение
				ЗаписьЖурналаРегистрации(
					"ЗагрузкаРекламногоРасхода",
					УровеньЖурналаРегистрации.Предупреждение,
					,
					,
					"Не удалось удалить документ " + КЗ.Ключ + ": " + ОписаниеОшибки()
				);
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;

	Возврат Итог;

КонецФункции

// Соответствие вида «маркер - ссылка» по документам окна.
Функция НайтиДокументыОкна(ОкноНачало, ОкноКонец)

	Результат = Новый Соответствие;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка,
		|	ПоступлениеТоваровУслуг.Комментарий КАК Комментарий
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|ГДЕ
		|	ПоступлениеТоваровУслуг.Дата МЕЖДУ &Начало И &Конец
		|	И ПоступлениеТоваровУслуг.Комментарий ПОДОБНО &Маркер";
	Запрос.УстановитьПараметр("Начало", НачалоДня(ОкноНачало));
	Запрос.УстановитьПараметр("Конец", КонецДня(ОкноКонец));
	Запрос.УстановитьПараметр("Маркер", "АвтоРеклама|%");

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		Результат.Вставить(СокрЛП(Выборка.Комментарий), Выборка.Ссылка);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Записать один документ группы. Возвращает Истина, если удалось провести.
Функция ЗаписатьДокументГруппы(Организация, Группа, Маркер, Ссылка)

	Если Ссылка = Неопределено Тогда
		Документ = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
		Документ.Дата = НачалоДня(Группа.День) + 12 * 3600;
	Иначе
		Документ = Ссылка.ПолучитьОбъект();
	КонецЕсли;

	Контрагент = КонтрагентКанала(Группа.Канал);
	Договор    = ДоговорПоставщика(Контрагент, Организация);
	Подразделение = ПодразделениеРекламы();

	Документ.Организация      = Организация;
	Документ.Контрагент       = Контрагент;
	Документ.ДоговорКонтрагента = Договор;
	Документ.ВалютаДокумента  = ВалютаГривна();
	Документ.КурсВзаиморасчетов    = 1;
	Документ.КратностьВзаиморасчетов = 1;
	Документ.ТипЦен           = Группа.ТипЦен;
	Документ.ВидОперации      = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия;
	// Без вида поступления и подразделения проведение не проходит
	Документ.ВидПоступления   = Перечисления.ВидыПоступленияТоваров.НаСклад;
	Документ.Подразделение    = Подразделение;
	Документ.Комментарий      = Маркер;
	// Реклама Google и Meta приходит без украинского НДС; бухгалтерский учёт
	// не включаем - иначе проведение требует счетов учёта, которых у этих
	// поставщиков в базе нет
	Документ.УчитыватьНДС     = Ложь;
	Документ.СуммаВключаетНДС = Истина;
	// Иначе проведение потребует заполненный тип цен, а у кампании его может
	// не быть: цены поставщика по рекламе никто не ведёт
	Документ.РегистрироватьЦеныПоставщика = Ложь;
	Документ.ОтражатьВУправленческомУчете = Истина;
	Документ.ОтражатьВБухгалтерскомУчете  = Ложь;

	Документ.Услуги.Очистить();

	СтатьяЗатрат = СтатьяЗатратРекламы();
	НоменклатурнаяГруппа = НоменклатурнаяГруппаРекламы();
	Всего = 0;

	Для Каждого СтрокаРасхода Из СвернутьСтроки(Группа.Строки) Цикл

		Номенклатура = НоменклатураКампании(СтрокаРасхода.Кампания, Группа.Канал);
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда
			Продолжить;
		КонецЕсли;

		// Содержание - строка неограниченной длины, группировать по такой нельзя,
		// поэтому ключ склейки живёт в самой кампании (реквизит КлючИсточника),
		// а сюда пишем человеческую расшифровку - её видно в печатных формах
		// и в самом документе.
		СтрокаУслуг = Документ.Услуги.Добавить();
		СтрокаУслуг.Номенклатура = Номенклатура;
		СтрокаУслуг.Содержание   =
			"Реклама " + Группа.Канал + ": " + СокрЛП(Строка(СтрокаРасхода.Кампания))
			+ " (" + СтрокаРасхода.Ключ + ") за " + Формат(Группа.День, "ДФ=dd.MM.yyyy");
		СтрокаУслуг.Подразделение = Подразделение;
		СтрокаУслуг.Количество   = 1;
		СтрокаУслуг.Цена         = СтрокаРасхода.Сумма;
		СтрокаУслуг.Сумма        = СтрокаРасхода.Сумма;
		СтрокаУслуг.СтавкаНДС    = Перечисления.СтавкиНДС.БезНДС;
		СтрокаУслуг.СуммаНДС     = 0;
		СтрокаУслуг.СтатьяЗатрат = СтатьяЗатрат;
		СтрокаУслуг.НоменклатурнаяГруппа = НоменклатурнаяГруппа;

		Всего = Всего + СтрокаРасхода.Сумма;

	КонецЦикла;

	Документ.СуммаДокумента = Всего;

	Если Документ.Услуги.Количество() = 0 Тогда
		// Нечего начислять - документ не заводим
		Возврат Истина;
	КонецЕсли;

	Попытка
		Документ.Записать(РежимЗаписиДокумента.Проведение);
		Возврат Истина;
	Исключение
		ЗаписьЖурналаРегистрации(
			"ЗагрузкаРекламногоРасхода",
			УровеньЖурналаРегистрации.Предупреждение,
			,
			,
			"Документ " + Маркер + " записан без проведения: " + ОписаниеОшибки()
		);
	КонецПопытки;

	Документ.Записать(РежимЗаписиДокумента.Запись);

	Возврат Ложь;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СПРАВОЧНИКИ: ищем по имени, заводим, если нет

// Организация начисления. Зашита кодом: в базе их несколько, заполнять
// константу после каждой загрузки конфигурации - лишний шаг, о котором забывают.
// Константа ОрганизацияРекламы, если её заполнить, значение переопределяет.
// Код фиксированной длины 9 - "000000001", как в самом справочнике.
Функция ОрганизацияНачисления()

	Из1 = Константы.ОрганизацияРекламы.Получить();
	Если ЗначениеЗаполнено(Из1) Тогда
		Возврат Из1;
	КонецЕсли;

	Ссылка = Справочники.Организации.НайтиПоКоду("000000001");
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Ссылка;
	КонецЕсли;

	// Кода не нашлось - последняя попытка: если организация в базе одна,
	// выбирать всё равно не из чего
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 2
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	НЕ Организации.ПометкаУдаления";

	Таблица = Запрос.Выполнить().Выгрузить();

	Если Таблица.Количество() = 1 Тогда
		Возврат Таблица[0].Ссылка;
	КонецЕсли;

	Возврат Справочники.Организации.ПустаяСсылка();

КонецФункции

Функция ИмяКонтрагентаКанала(Канал)

	Если Канал = "google ads" Тогда
		Возврат "Google Ads";
	ИначеЕсли Канал = "facebook ads" Тогда
		Возврат "Meta Platforms";
	КонецЕсли;

	Возврат "Реклама " + Канал;

КонецФункции

Функция КонтрагентКанала(Канал)

	Имя = ИмяКонтрагентаКанала(Канал);

	Ссылка = Справочники.Контрагенты.НайтиПоНаименованию(Имя, Истина);
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Ссылка;
	КонецЕсли;

	Элемент = Справочники.Контрагенты.СоздатьЭлемент();
	Элемент.Наименование = Имя;
	Элемент.НаименованиеПолное = Имя;
	Элемент.Поставщик = Истина;
	Элемент.Записать();

	Возврат Элемент.Ссылка;

КонецФункции

Функция ДоговорПоставщика(Контрагент, Организация)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Владелец = &Контрагент
		|	И ДоговорыКонтрагентов.Организация = &Организация
		|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)
		|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		// Договор мог остаться от прежнего прогона недозаполненным - тогда
		// проведение падает с «Не указан способ ведения взаиморасчетов
		// по договору». Дочиниваем на месте, а не заводим второй договор.
		ДозаполнитьДоговор(Выборка.Ссылка);
		Возврат Выборка.Ссылка;
	КонецЕсли;

	Элемент = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
	Элемент.Владелец = Контрагент;
	Элемент.Организация = Организация;
	Элемент.Наименование = "Реклама";
	Элемент.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
	Элемент.ВалютаВзаиморасчетов = ВалютаГривна();
	// Без способа ведения взаиморасчётов документ не проводится. По договору
	// в целом: заказов поставщику и счетов у рекламных кабинетов нет
	Элемент.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;
	Элемент.Записать();

	Возврат Элемент.Ссылка;

КонецФункции

Процедура ДозаполнитьДоговор(Ссылка)

	Если ЗначениеЗаполнено(Ссылка.ВедениеВзаиморасчетов)
		И ЗначениеЗаполнено(Ссылка.ВалютаВзаиморасчетов) Тогда
		Возврат;
	КонецЕсли;

	Попытка

		Элемент = Ссылка.ПолучитьОбъект();

		Если Не ЗначениеЗаполнено(Элемент.ВедениеВзаиморасчетов) Тогда
			Элемент.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(Элемент.ВалютаВзаиморасчетов) Тогда
			Элемент.ВалютаВзаиморасчетов = ВалютаГривна();
		КонецЕсли;

		Элемент.Записать();

	Исключение

		ЗаписьЖурналаРегистрации(
			"ЗагрузкаРекламногоРасхода",
			УровеньЖурналаРегистрации.Предупреждение,
			,
			,
			"Не удалось дозаполнить договор " + Строка(Ссылка) + ": " + ОписаниеОшибки()
		);

	КонецПопытки;

КонецПроцедуры

// Уборка двойников: пока сайт не отдавал ID, кампания заводилась по имени,
// а потом рядом появлялась вторая запись - уже с идентификатором.
// Удаляем непосредственно, без пометки: пометками в этой базе не пользуются.
// Безопасно это потому, что вызывается ПОСЛЕ перезаписи документов окна -
// строки услуг к этому моменту уже переставлены на кампанию с идентификатором.
// Кампании, у которых ID нет ни у одной записи (ручной ввод на сайте), не трогаем.
// Номенклатуру-услугу двойника не удаляем: на неё могут ссылаться документы
// за пределами окна загрузки, и ссылка стала бы битой.
Функция УдалитьДублиКампаний()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	БезИд.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РекламныеКампании КАК БезИд
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РекламныеКампании КАК СИд
		|		ПО БезИд.Наименование = СИд.Наименование
		|			И БезИд.Канал = СИд.Канал
		|ГДЕ
		|	БезИд.ИдентификаторКампании = """"
		|	И НЕ СИд.ИдентификаторКампании = """"";

	Выборка = Запрос.Выполнить().Выбрать();
	Удалено = 0;

	Пока Выборка.Следующий() Цикл
		Попытка
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			Объект.Удалить();
			Удалено = Удалено + 1;
		Исключение
			ЗаписьЖурналаРегистрации(
				"ЗагрузкаРекламногоРасхода",
				УровеньЖурналаРегистрации.Предупреждение,
				,
				,
				"Не удалось удалить дубль кампании " + Строка(Выборка.Ссылка) + ": " + ОписаниеОшибки()
			);
		КонецПопытки;
	КонецЦикла;

	Возврат Удалено;

КонецФункции

// Статья затрат. Модуль справочника требует вид и характер затрат, иначе
// «Укажите вид затрат!» и запись не проходит. Реклама - расходы на сбыт.
// Ключ источника вписывают руками, и один и тот же ключ легко попадает
// на две кампании (копипастой). Отчёт тогда честно сольёт их расход в одну
// строку - причём разных каналов, - и понять это по цифрам почти невозможно.
// Поэтому проверяем и кричим в журнал: сами исправить не можем, это данные.
Функция ПроверитьКлючиКампаний()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РекламныеКампании.КлючИсточника КАК Ключ,
		|	КОЛИЧЕСТВО(РекламныеКампании.Ссылка) КАК Сколько
		|ИЗ
		|	Справочник.РекламныеКампании КАК РекламныеКампании
		|ГДЕ
		|	РекламныеКампании.КлючИсточника <> """"
		|
		|СГРУППИРОВАТЬ ПО
		|	РекламныеКампании.КлючИсточника
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РекламныеКампании.Ссылка) > 1";

	Выборка = Запрос.Выполнить().Выбрать();
	Ключи = Новый Массив;

	Пока Выборка.Следующий() Цикл
		Ключи.Добавить(СокрЛП(Выборка.Ключ) + " (кампаний: " + Строка(Выборка.Сколько) + ")");
	КонецЦикла;

	Если Ключи.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;

	Текст = "один ключ источника у нескольких кампаний, их расход в отчёте сольётся в одну строку: "
		+ СтрСоединить(Ключи, "; ");

	ЗаписьЖурналаРегистрации(
		"ЗагрузкаРекламногоРасхода",
		УровеньЖурналаРегистрации.Предупреждение,
		,
		,
		Текст
	);

	Возврат Текст;

КонецФункции

Функция СтатьяЗатратРекламы()

	Ссылка = Справочники.СтатьиЗатрат.НайтиПоНаименованию("Реклама", Истина);

	Если ЗначениеЗаполнено(Ссылка) Тогда
		// Статья могла существовать в базе недозаполненной - дочиняем на месте
		Если ЗначениеЗаполнено(Ссылка.ВидЗатрат) И ЗначениеЗаполнено(Ссылка.ХарактерЗатрат) Тогда
			Возврат Ссылка;
		КонецЕсли;
		Элемент = Ссылка.ПолучитьОбъект();
	Иначе
		Элемент = Справочники.СтатьиЗатрат.СоздатьЭлемент();
		Элемент.Наименование = "Реклама";
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Элемент.ВидЗатрат) Тогда
		Элемент.ВидЗатрат = Перечисления.ВидыЗатрат.Прочие;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Элемент.ХарактерЗатрат) Тогда
		Элемент.ХарактерЗатрат = Перечисления.ХарактерЗатрат.РасходыНаСбыт;
	КонецЕсли;

	Элемент.Записать();

	Возврат Элемент.Ссылка;

КонецФункции

// Номенклатурная группа. Модуль справочника требует базовую единицу измерения:
// «Перед записью ... необходимо заполнить "базовая единица"».
Функция НоменклатурнаяГруппаРекламы()

	Ссылка = Справочники.НоменклатурныеГруппы.НайтиПоНаименованию("Реклама", Истина);

	Если ЗначениеЗаполнено(Ссылка) Тогда
		Если ЗначениеЗаполнено(Ссылка.БазоваяЕдиницаИзмерения) Тогда
			Возврат Ссылка;
		КонецЕсли;
		Элемент = Ссылка.ПолучитьОбъект();
	Иначе
		Элемент = Справочники.НоменклатурныеГруппы.СоздатьЭлемент();
		Элемент.Наименование = "Реклама";
	КонецЕсли;

	Элемент.БазоваяЕдиницаИзмерения = ЕдиницаШтука();
	Элемент.Записать();

	Возврат Элемент.Ссылка;

КонецФункции

// Штука из классификатора: код 796 по ОКЕИ. Если классификатор заполнен
// нестандартно - ищем по наименованию, в последнюю очередь берём что есть.
Функция ЕдиницаШтука()

	Ссылка = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("796");
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Ссылка;
	КонецЕсли;

	Ссылка = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт", Истина);
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Ссылка;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КлассификаторЕдиницИзмерения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
		|ГДЕ
		|	НЕ КлассификаторЕдиницИзмерения.ПометкаУдаления";

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	Возврат Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка();

КонецФункции

// Подразделение для шапки и строк услуг: без него документ не проводится.
Функция ПодразделениеРекламы()

	Ссылка = Справочники.Подразделения.НайтиПоНаименованию("Основное подразделение", Истина);
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Ссылка;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Подразделения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Подразделения КАК Подразделения
		|ГДЕ
		|	НЕ Подразделения.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Подразделения.Код";

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	Элемент = Справочники.Подразделения.СоздатьЭлемент();
	Элемент.Наименование = "Основное подразделение";
	Элемент.Записать();

	Возврат Элемент.Ссылка;

КонецФункции

// Вид номенклатуры для услуг: модуль номенклатуры требует его всегда,
// независимо от того, товар это или услуга.
Функция ВидНоменклатурыУслуга()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВидыНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|ГДЕ
		|	ВидыНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|	И НЕ ВидыНоменклатуры.ПометкаУдаления";

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	Элемент = Справочники.ВидыНоменклатуры.СоздатьЭлемент();
	Элемент.Наименование = "Услуга";
	Элемент.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга;
	Элемент.Записать();

	Возврат Элемент.Ссылка;

КонецФункции

Функция ВалютаГривна()

	Возврат Справочники.Валюты.НайтиПоКоду("980");

КонецФункции

// Услуга кампании. Номенклатура заводится один раз и запоминается в самой
// кампании: имя кампании в кабинете может смениться, ссылка - нет.
Функция НоменклатураКампании(Кампания, Канал)

	Если Не ЗначениеЗаполнено(Кампания) Тогда
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;

	Номенклатура = Кампания.Номенклатура;
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Номенклатура;
	КонецЕсли;

	Попытка

		Элемент = Справочники.Номенклатура.СоздатьЭлемент();
		Элемент.Наименование = Лев("Реклама: " + СокрЛП(Кампания.Наименование), 100);
		// Услуга снимает требование базовой единицы измерения, но вид
		// номенклатуры модуль справочника требует в любом случае
		Элемент.Услуга = Истина;
		Элемент.ВидНоменклатуры = ВидНоменклатурыУслуга();
		Элемент.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
		Элемент.Записать();

		Кампания1 = Кампания.ПолучитьОбъект();
		Кампания1.Номенклатура = Элемент.Ссылка;
		Кампания1.Записать();

		Возврат Элемент.Ссылка;

	Исключение

		ЗаписьЖурналаРегистрации(
			"ЗагрузкаРекламногоРасхода",
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			"Не удалось завести услугу для кампании " + Строка(Кампания) + ": " + ОписаниеОшибки()
		);

		Возврат Справочники.Номенклатура.ПустаяСсылка();

	КонецПопытки;

КонецФункции

// Найти или завести кампанию. Ищем по идентификатору кабинета, а не по имени:
// имя кампании переживает переименования только как подпись.
// Сегмент подсказкой сайта заполняется ТОЛЬКО при создании - дальше он
// назначается руками в 1С и подсказку переопределяет.
Функция КампанияПоСтроке(Стр, Ключ, Кэш)

	Ид   = СокрЛП(Строка(Стр.Получить("campaign_id")));
	Имя  = Лев(СокрЛП(Строка(Стр.Получить("campaign"))), 150);
	Канал = Лев(СокрЛП(Строка(Стр.Получить("channel"))), 32);

	Если ПустаяСтрока(Ид) И ПустаяСтрока(Имя) Тогда
		Возврат Справочники.РекламныеКампании.ПустаяСсылка();
	КонецЕсли;

	КлючКэша = ?(ПустаяСтрока(Ид), "имя:" + Канал + "|" + Имя, "ид:" + Ид);

	Ссылка = Кэш.Получить(КлючКэша);
	Если Ссылка <> Неопределено Тогда
		Возврат Ссылка;
	КонецЕсли;

	Ссылка = НайтиКампанию(Ид, Имя, Канал);

	Если Ссылка = Неопределено Тогда

		Элемент = Справочники.РекламныеКампании.СоздатьЭлемент();
		Элемент.Наименование = Имя;
		Элемент.ИдентификаторКампании = Ид;
		Элемент.Канал = Канал;
		Элемент.КлючИсточника = Ключ;
		Элемент.Сегмент = СегментПоПодсказке(Стр.Получить("segment_hint"));

		Попытка
			Элемент.Записать();
			Ссылка = Элемент.Ссылка;
		Исключение
			ЗаписьЖурналаРегистрации(
				"ЗагрузкаРекламногоРасхода",
				УровеньЖурналаРегистрации.Ошибка,
				,
				,
				"Не удалось создать кампанию """ + Имя + """: " + ОписаниеОшибки()
			);
			Ссылка = Справочники.РекламныеКампании.ПустаяСсылка();
		КонецПопытки;

	Иначе

		ОбновитьКампанию(Ссылка, Ид, Имя, Канал, Ключ);

	КонецЕсли;

	Кэш.Вставить(КлючКэша, Ссылка);

	Возврат Ссылка;

КонецФункции

Функция НайтиКампанию(Ид, Имя, Канал)

	Если Не ПустаяСтрока(Ид) Тогда

		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	РекламныеКампании.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.РекламныеКампании КАК РекламныеКампании
			|ГДЕ
			|	РекламныеКампании.ИдентификаторКампании = &Ид";
		Запрос.УстановитьПараметр("Ид", Ид);

		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;

		// По ID не нашли - но кампания могла попасть сюда раньше, когда сайт ID
		// ещё не отдавал. Забираем ту запись себе (ID проставится в ОбновитьКампанию)
		// вместо того, чтобы плодить вторую с тем же именем.
	КонецЕсли;

	// Строка без идентификатора: старые дни таблицы сайта, где колонки campaign_id
	// ещё не было, и ручной ввод расхода. Ищем по имени и каналу БЕЗ условия
	// на пустой ID - иначе рядом с нормальной кампанией заводится её двойник
	// без идентификатора. Сортировка по убыванию ставит записи с ID первыми.
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РекламныеКампании.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РекламныеКампании КАК РекламныеКампании
		|ГДЕ
		|	РекламныеКампании.Наименование = &Имя
		|	И РекламныеКампании.Канал = &Канал
		|	И НЕ РекламныеКампании.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	РекламныеКампании.ИдентификаторКампании УБЫВ";
	Запрос.УстановитьПараметр("Имя", Имя);
	Запрос.УстановитьПараметр("Канал", Канал);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

// Переименование в кабинете подтягиваем, сегмент и тип цен не трогаем -
// их назначает человек. Идентификатор проставляем, если его ещё нет: так
// запись, заведённая до разметки кабинетов, забирает себе свой ID вместо того,
// чтобы рядом появилась вторая такая же.
Процедура ОбновитьКампанию(Ссылка, Ид, Имя, Канал, Ключ)

	Если ПустаяСтрока(Имя) Тогда
		Возврат;
	КонецЕсли;

	НужноПроставитьИд = Не ПустаяСтрока(Ид) И ПустаяСтрока(Ссылка.ИдентификаторКампании);

	// Ключ источника - ручное поле. Сайт умеет посчитать его только из ID кампании,
	// а в ссылках кабинета может стоять что угодно («facebook cold_catalog_atc»).
	// Поэтому заполняем его лишь пока он пустой: значение, вписанное человеком,
	// затирать нельзя - иначе кампания перестанет сходиться с заказами.
	НужноПроставитьКлюч = ПустаяСтрока(Ссылка.КлючИсточника) И Не ПустаяСтрока(Ключ);

	Если Не НужноПроставитьИд
		И Не НужноПроставитьКлюч
		И СокрЛП(Ссылка.Наименование) = Имя
		И СокрЛП(Ссылка.Канал) = Канал Тогда
		Возврат;
	КонецЕсли;

	Попытка
		Элемент = Ссылка.ПолучитьОбъект();
		Элемент.Наименование = Имя;
		Элемент.Канал = Канал;
		Если НужноПроставитьКлюч Тогда
			Элемент.КлючИсточника = Ключ;
		КонецЕсли;
		Если НужноПроставитьИд Тогда
			Элемент.ИдентификаторКампании = Ид;
		КонецЕсли;
		Элемент.Записать();
	Исключение
		ЗаписьЖурналаРегистрации(
			"ЗагрузкаРекламногоРасхода",
			УровеньЖурналаРегистрации.Предупреждение,
			,
			,
			"Не удалось обновить кампанию """ + Имя + """: " + ОписаниеОшибки()
		);
	КонецПопытки;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНОЕ

// Одна кампания может прийти двумя строками одного дня - складываем заранее,
// иначе в документе будут две строки услуг на одну услугу.
Функция СвернутьСтроки(Массив)

	Свод = Новый Соответствие;

	Для Каждого Стр Из Массив Цикл
		КлючСтроки = Строка(Стр.Кампания) + Символы.ПС + Стр.Ключ;
		Текущая = Свод.Получить(КлючСтроки);
		Если Текущая = Неопределено Тогда
			Свод.Вставить(КлючСтроки, Новый Структура("Кампания, Ключ, Сумма",
				Стр.Кампания, Стр.Ключ, Стр.Сумма));
		Иначе
			Текущая.Сумма = Текущая.Сумма + Стр.Сумма;
		КонецЕсли;
	КонецЦикла;

	Результат = Новый Массив;
	Для Каждого КЗ Из Свод Цикл
		Результат.Добавить(КЗ.Значение);
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция СегментПоПодсказке(Подсказка)

	Значение = НРег(СокрЛП(Строка(Подсказка)));

	Если Значение = "opt" Тогда
		Возврат Перечисления.СегментыРекламы.Опт;
	ИначеЕсли Значение = "drop" Тогда
		Возврат Перечисления.СегментыРекламы.Дропшип;
	ИначеЕсли Значение = "rozn" Тогда
		Возврат Перечисления.СегментыРекламы.Розница;
	КонецЕсли;

	Возврат Перечисления.СегментыРекламы.ПустаяСсылка();

КонецФункции

Функция ДатаИзСтроки(Значение, ПоУмолчанию)

	Стр = СокрЛП(Строка(Значение));

	Если СтрДлина(Стр) < 10 Тогда
		Возврат ПоУмолчанию;
	КонецЕсли;

	Попытка
		Возврат Дата(Число(Лев(Стр, 4)), Число(Сред(Стр, 6, 2)), Число(Сред(Стр, 9, 2)));
	Исключение
		Возврат ПоУмолчанию;
	КонецПопытки;

КонецФункции

Функция ЧислоИзЗначения(Значение)

	Если ТипЗнч(Значение) = Тип("Число") Тогда
		Возврат Значение;
	КонецЕсли;

	Попытка
		Возврат Число(СтрЗаменить(СокрЛП(Строка(Значение)), ",", "."));
	Исключение
		Возврат 0;
	КонецПопытки;

КонецФункции
